# pd.DataFrame

In [1]:
import pandas as pd
import numpy as np

In [10]:
data = {'X': [2, 4], 'Y': [1, 3]}
new = pd.DataFrame(data)

In [11]:
new.head()

   X  Y
0  2  1
1  4  3

In [12]:
new.columns = ['even', 'odd']

In [13]:
new

   even  odd
0     2    1
1     4    3

# pd.Series

In [6]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

In [7]:
df = pd.concat([s1, s2, s3], axis=1)

In [8]:
df.head()

   0  1      2
0  4  1  24057
1  2  3  10142
2  4  1  13826
3  1  1  18164
4  1  1  13344

# reset index

In [49]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj', 'Geeku'], 
        'Age':[27, 24, 22, 32, 15], 
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj', 'Noida'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd', '10th'] } 
  
index = {'a', 'b', 'c', 'd', 'e'} 

df = pd.DataFrame(data, index)

In [50]:
#df.reset_index(inplace = True,  drop =  True)

In [51]:
df

  index    Name  Age    Address Qualification
0     b     Jai   27      Delhi           Msc
1     c  Princi   24     Kanpur            MA
2     d  Gaurav   22  Allahabad           MCA
3     e    Anuj   32    Kannauj           Phd
4     a   Geeku   15      Noida          10th

# set index

In [56]:
df.set_index('index').head()

         Name    Address Qualification
index
b         Jai      Delhi           Msc
c      Princi     Kanpur            MA
d      Gaurav  Allahabad           MCA
e        Anuj    Kannauj           Phd
a       Geeku      Noida          10th

In [58]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj', 'Geeku'], 
        'Age':[27, 24, 22, 32, 15], 
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj', 'Noida'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd', '10th'] } 
  

index = {'a', 'b', 'c', 'd', 'e'} 
  

df = pd.DataFrame(data, index) 

df.set_index(['Age'], inplace = True) 
  
df

       Name    Address Qualification
Age
27      Jai      Delhi           Msc
24   Princi     Kanpur            MA
22   Gaurav  Allahabad           MCA
32     Anuj    Kannauj           Phd
15    Geeku      Noida          10th

In [61]:

data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj', 'Geeku'], 
        'Age':[27, 24, 22, 32, 15], 
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj', 'Noida'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd', '10th'] } 
  

index = {'a', 'b', 'c', 'd', 'e'} 
  
  
df = pd.DataFrame(data, index) 
  

df.set_index(['Age'], inplace = True) 
    
df.reset_index(level =['Age'], inplace = True) 
  
df

   Age    Name    Address Qualification
0   27     Jai      Delhi           Msc
1   24  Princi     Kanpur            MA
2   22  Gaurav  Allahabad           MCA
3   32    Anuj    Kannauj           Phd
4   15   Geeku      Noida          10th

# fillna

In [67]:
f = pd.DataFrame([[np.nan, 2, np.nan, 0],
                  [3, 4, np.nan, 1],
                  [np.nan, np.nan, np.nan, 5],
                  [np.nan, 3, np.nan, 4]],
                  columns=list('ABCD'))

In [68]:
f

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [76]:
f.fillna(0)

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5
3  0.0  3.0  0.0  4